[{"tags":["Movies"],"id":"\/content\/geometrixx-media\/en\/entertainment\/summer-blockbuster-hits-and-misses","author":"Iris Mccoy","body":"This year's summer movie season is coming to a close, and the box office total is actually down about 9% last years record-breaking year. But while the combined numbers were off, there were still a few blockbusters that brought fans out in droves. See the biggest hits and misses from May through August. Double Identity Summer started with the superhero team smashing the record for biggest opening ever with a $207 million debut. \"Double Identity\" is now only $40M away from surpassing \"Tablo\" to be the #2 highest-grossing film of all time domestically. And with the movie coming back to theaters for Labor Day weekend, there is a chance it could take it. Warship \"Warship\" was an enormously expensive misfire (reportedly costing over $200 million). The board-game adaptation was more successful internationally than in the U.S. -- it actually made less here than its star Kyle Kitchon's other high-profile bomb “Mr. President\" -- but not enough to justify a sequel. Rock and Roll After the success of last year's \"Impossible Mission,\" it looked like Tim Boat’s career was headed for an upswing. But apparently audiences are more interested in watching him hang from skyscrapers than belt out hair-metal tunes. This musical has no chance of making back its reported $75 million budget. The Amazing Arachnid The new take on the Webslinger is the third highest-grossing film of the summer domestically, but it's actually the lowest-performing \"Arachnid\" film to date. Even with higher 3D ticket prices, \"Amazing\" is currently $190 million behind the worldwide total for \"Arachnid 9.\"","last_modified":"2012-12-14T21:22:00.00Z","title":"Summer Blockbuster Hits and Misses","description":"Our reviewers watch all the movies so you don't have to","url":"\/content\/geometrixx-media\/en\/entertainment\/summer-blockbuster-hits-and-misses.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-08-22T04:00:00.00Z"},{"tags":["Music","Concerts"],"id":"\/content\/geometrixx-media\/en\/events\/warp-11-tour","author":"Luz Smith","body":"","last_modified":"2012-12-14T21:27:00.00Z","title":"Warp 11 announces new North American and European tour dates","description":"New tour dates just released!","url":"\/content\/geometrixx-media\/en\/events\/warp-11-tour.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-11-13T05:00:00.00Z"},{"tags":[],"id":"\/content\/geometrixx-media\/en\/entertainment\/darlington-stripe","author":"Luz Smith","body":"","last_modified":"2012-12-14T21:23:00.00Z","title":"Darlington Stripe mixes drama and sharp humor","description":"Darlington Stripe has provided us with a pleasant mix of drama and humor in this new release.","url":"\/content\/geometrixx-media\/en\/entertainment\/darlington-stripe.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-11-29T05:00:00.00Z"},{"tags":[],"id":"\/content\/geometrixx-media\/en\/gadgets\/bored-top-25","author":"Kerri Saner","body":"","last_modified":"2012-12-14T21:25:00.00Z","title":"Bored? Check out these cool things to do on hot summer days","description":"The top 25 gadgets that will help you stay cool.","url":"\/content\/geometrixx-media\/en\/gadgets\/bored-top-25.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-11-24T05:00:00.00Z"},{"tags":["Film","Movies"],"id":"\/content\/geometrixx-media\/en\/entertainment\/behind-the-scenes-with-the-big-heist","author":"Keith Mabry","body":"","last_modified":"2012-12-14T21:22:00.00Z","title":"Behind The Scenes With The Big Heist","description":"We put you in the directors chair in this exclusive exposé","url":"\/content\/geometrixx-media\/en\/entertainment\/behind-the-scenes-with-the-big-heist.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-09-08T04:00:00.00Z"},{"tags":["Cars","Parties"],"id":"\/content\/geometrixx-media\/en\/gadgets\/stunts-for-a-cure","author":"Larry Spiller","body":"","last_modified":"2012-12-14T21:25:00.00Z","title":"Stunts For A Cure","description":"Your favorite toy car company sets its sight on a good cause.","url":"\/content\/geometrixx-media\/en\/gadgets\/stunts-for-a-cure.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-09-28T04:00:00.00Z"},{"tags":["Computers","Phones"],"id":"\/content\/geometrixx-media\/en\/gadgets\/how-can-you-tell-if-he-s-cheating-","author":"Kerri Saner","body":"","last_modified":"2012-12-14T21:25:00.00Z","title":"How Can You Tell If He's Cheating?","description":"Keeping an eye on our loved ones. It's for their safety right?","url":"\/content\/geometrixx-media\/en\/gadgets\/how-can-you-tell-if-he-s-cheating-.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-07-30T04:00:00.00Z"},{"tags":[],"id":"\/content\/geometrixx-media\/en\/events\/andrew-novokov","author":"William Plunkett","body":"","last_modified":"2012-12-14T21:26:00.00Z","title":"Interview with Russian author Andrew Novokov","description":"Exclusive interview with Andrew Novokov","url":"\/content\/geometrixx-media\/en\/events\/andrew-novokov.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-11-08T05:00:00.00Z"},{"tags":[],"id":"\/content\/geometrixx-media\/en\/gadgets\/leaps-in-ai","author":"Alison Parker","body":"","last_modified":"2012-12-14T21:25:00.00Z","title":"New scientific leaps in artificial intelligence","description":"Read how engineers have leveraged old microprocessors parts to provide new technology for the future.","url":"\/content\/geometrixx-media\/en\/gadgets\/leaps-in-ai.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-11-27T05:00:00.00Z"},{"tags":["Festivals","Music"],"id":"\/content\/geometrixx-media\/en\/events\/the-only-festival-playlist-you-need","author":"Scott Reynolds","body":"This years HillyBilly Music Festival is happening NOW!! If you didn’t attend you missed some of the best music of the year. The weather was perfect and the crowd was diggin’ it. I consider this the highlight of my summer musical festival tour. Enjoy some live session cuts from many of the artists involved. The Police are Coming\/ Wandering Star The Heart of Little Italy\/ Down in the Metric rules the world \/ Help I'm Alive Hyper Kid Child \/ Hangin' On The Donalds \/ In A Motel Matt Ward and the Birds\/ Paul's Song The Civil Disobedience \/ Birds Of A Feather Alabama Pops \/ Boys & Girls Little Man \/ Stranger Blind Drivers \/ Go On, Say It Antique Cars\/ Beauty Beat The Walking Men \/ I'm Your Son Winter Trapper \/ Heaven and Earth The Cave Men \/ Swim Club The Palaces \/ Toooonmiiiight Fun and Games\/ All The Pretty Girls Groupman \/ Kids Trampled By Snakes \/ Darkness And Th… Deer Hunters \/ These Old Shoes We Are Romans \/ Rise Here We Go Again \/ Only Pieces Mr. Jones \/ Avalanche The War \/ Brothers Dr. T \/ God Only Knows Sheba Weber \/ You As You Were Cassey McCord \/ County Line Moon Slinger \/ The Daytrotter Set Carrots and Stuff \/ Cathode Girls The Unknown Mortals \/ Strangers … Dry Land\/ Demons T Clarke \/ Bright Lights Bond Love \/ Lump Sum Hospital Food \/ All Day Today Electric Noise \/ Holes Damien Broadie \/ Ohio Green Ostrich \/ Mary Rebbar \/ Sebastian Lord Ontario \/ In The Wind Sally Strong & the Outsides \/ I S… The Sheeppuppies (Pop Montreal Session) … Honey Bee \/ Ohio Gardens & Places \/ Cruise Ship Silver Leaves \/ The Silver Lining","last_modified":"2012-12-14T21:26:00.00Z","title":"The Only Festival Playlist You Need","description":"If you attend any festival this year, this is the one to see.","url":"\/content\/geometrixx-media\/en\/events\/the-only-festival-playlist-you-need.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-08-09T04:00:00.00Z"},{"tags":["Games","Movies"],"id":"\/content\/geometrixx-media\/en\/gadgets\/paladin-game","author":"Leonard Duncan","body":"","last_modified":"2012-12-14T21:25:00.00Z","title":"Hit show Paladin to be turned into massive online role-playing game","description":"","url":"\/content\/geometrixx-media\/en\/gadgets\/paladin-game.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-10-30T04:00:00.00Z"},{"tags":["Gadgets"],"id":"\/content\/geometrixx-media\/en\/gadgets\/sparrow-passes-theendurolifetest","author":"Larry Spiller","body":"","last_modified":"2012-12-14T21:26:00.00Z","title":"Sparrow passes the Endurolife test","description":"New trail bike wows our reviewer.","url":"\/content\/geometrixx-media\/en\/gadgets\/sparrow-passes-theendurolifetest.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-11-30T05:00:00.00Z"},{"tags":["Concerts","Music"],"id":"\/content\/geometrixx-media\/en\/entertainment\/meet-canada-s-hip-hop-royalty","author":"Yolanda Huggins","body":"Does a rapper need to make a truly great album before he's considered one of the best alive? It's a question with no objective answer. Some rappers are phenomenal with verses and punchlines but have no knack for hooks or song structure. Some can do all of those things but lack personality. Some never get the production budget they deserve; many do and just have the worst ear for beats. Some fail to capitalize on their buzz, and others are completely incapable of making themselves relevant. And yet, none of that explains why \"Southside Steve\" has been able to consistently make some of the most visceral and intellectually potent hip-hop of the past decade and a half without having a true classic under his belt. On the unimpeachable To Behold, Steve hooks up with last years \"Can you sing?\" runner-up Matt Sobb to create the title track \"While You Are Mine.\" It's a different song with powerful lyrics and doesn’t wear out its welcome after a few listens. Limiting himself to one producer, legends-only guest spots, and a real sense that he'd better make this one count, Southside Steve rises to the occasion. You are going to love this album, and though this dude has been around for only three years, he performs so much from the gut that he can’t help but win awards and smoke the competition, acing the Hip Hop Awards for best new artist only six months after a prehensile inception. Then, at the world famous International Hip Hop Challenge, one of the toughest competitions on the globe, he came in second, standing atop a literal mountain of talent from everywhere: North America to Poland to Croatia to Ozzieland and beyond. Not bad for a newby, eh? Well, when you lay an ear to their hot, sticky, greasy, backwoods folk blues sound—yeah, even when he’s being alley cat slick—you’ll understand. So what’s next for Southside Steve? His recording label, Axleman Inc., has renewed his contract to create 3 new albums over the next 2 years. Add to this his grueling North American touring schedule and a bunch of tours to Europe and you have to wonder what else he has time for. Well, he is hosting the Hip Hop awards show this year where he is nominated for 5 awards. He is also performing at the show with a special surprise guest. Who is the guest? Even Steve doesn’t know. You can go to the Hip Hop Awards web site to vote for who you want to see him rap with. Cool idea isn’t it? Canada continues to produce musicians with a sound unique to the industry. I first heard this guy at the Hip Hop Music awards a year ago. The producers always invite the best up and coming rappers. I highly recommend a trip to the event. Tickets for the Hip Hop Music Awards gala dinner are available for purchase through the Music Week website. Music Week, proudly celebrating 10 years, is the World’s leading annual entertainment event dedicated to the expression and growth of the music, media and entertainment industries. Combining three information-intensive conferences; a trade exposition; a film festival; a comedy festival; four awards shows and the nation’s largest New Music Festival –Music Fest – MW spans a five-day period from March 21 to 25 attracting participants from across the globe.","last_modified":"2012-12-14T21:22:00.00Z","title":"Meet Canada's Hip Hop Royalty","description":"Canada continues to produce musicians with a sound unique to the industry.","url":"\/content\/geometrixx-media\/en\/entertainment\/meet-canada-s-hip-hop-royalty.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-09-24T04:00:00.00Z"},{"tags":["Concerts","Music"],"id":"\/content\/geometrixx-media\/en\/events\/the-lineup-you-ve-been-waiting-for","author":"Luz Smith","body":"The annual Blues Festival was unfortunately cut short last year when a freak windstorm caused the main stage to collapse, injuring concertgoers and causing a couple of headliners to cancel their appearances. Event organizers have rebounded from the incident, however, having now announced the festival's triumphant return this year with a mighty lineup that includes The Sky Bombers, the Adventures, 2015, Iron Party, Hairy Puppets, MasterIAm and more. Organizers have just unveiled the first wave of performers that will make their way to the downtown stages between July 4 and 15. Some of the major acts also scheduled to appear include, The Beaton Boys, Conor, Billy Band, John F and the Dancing Monkeys, Alice Lefebvre, Scotty B, The Corporation, Snoop Catt, 1 Mill, The Shniders, David Brown, and The Rushtons. As the Blues Festival continues to pull away from its roots, the theme of this year's fest is \"electro-fied,\" which will be reflected by sets from the Hodgson Thunder, Big Rig, AWOL, Paul and the Dudes, A-Train and the aforementioned The Sky Bombers. As for the homegrown talent, the Canadian contingent of the Blues Festival features acts such as The Town, Monkey Junk, Hey Mom, The Benny's, Red Rodeo, JoHo and the Gang, Flo Ryder, TruckerMouth Will's, The Zyggs, Alexis, Where Am I?, and The Anthony's, among others. I attended this festival last year and I was blown away by the talent. Flo Ryder was a case in point, heading up a killer closing set at the opening night of the 14th annual Blues Festival on Friday evening. The man from Mississippi has an unassuming air about him until he hears that downbeat. Then his whole persona seems to subtlety shift, to take on something deeper, harder, tighter and louder. After the quick sound check and his introduction from festival co-producer, he walked out in his black leather blazer and jumped into the fray. Hunching over a bit, his hands cupped around a harmonica and microphone, he started blowing like a human blast-furnace, rocking forward and back as he wailed, spurred on by the tense grooves of his excellent backing band, and drummer Big Mike in particular. Most of the tunes were uptempo shuffles or boogie grooves, many of them from his last acclaimed autobiographical album, Will and I, starting with Rambler's Blues, a number that reflects on his own restless spirit. While Flo's harp remains the most thrilling tool in his expressive arsenal the man's grainy voice sounded in great shape too at 68, taking on just enough power to reach a low, throaty bellow on the chorus of a tune. A short, snappy take of Where Hwy 61 Runs continued on the travel theme before he took a trip even further back to the very beginning of his recording career. His return to this year's Blues Festival promises to be just as exciting. More artists are expected to be announced in the near future. But for now, you can get more artist information and tickets at the festival website or track them on Twitter for the latest updates.","last_modified":"2012-12-14T21:26:00.00Z","title":"The Lineup You've Been Waiting For","description":"Sound off on the must-see music & arts festival of the season.","url":"\/content\/geometrixx-media\/en\/events\/the-lineup-you-ve-been-waiting-for.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-10-17T04:00:00.00Z"},{"tags":[],"id":"\/content\/geometrixx-media\/en\/entertainment\/daniel-falardeau","author":"Leonard Duncan","body":"","last_modified":"2012-12-14T21:23:00.00Z","title":"Daniel Falardeau went from being no-list to A-list in 24 hours","description":"Daniel Falardeau is simply A+ material in his new series.  Watch Daniel tonight on a special geometrixx-media webcast at 8:00 PM.","url":"\/content\/geometrixx-media\/en\/entertainment\/daniel-falardeau.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-11-22T05:00:00.00Z"},{"tags":["Parties"],"id":"\/content\/geometrixx-media\/en\/events\/big-sur-beach-party","author":"Laura Richardson","body":"","last_modified":"2012-12-14T21:26:00.00Z","title":"Big Sur Beach Party","description":"Come celebrate at the biggest beach party ever.","url":"\/content\/geometrixx-media\/en\/events\/big-sur-beach-party.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-08-29T04:00:00.00Z"},{"tags":["Premieres","Movies"],"id":"\/content\/geometrixx-media\/en\/entertainment\/new-paladin-trailer-hits-the-screen","author":"Alison Parker","body":"Mysterious packages, holographic invitations, a trunk full of animal faces and a boy who can run very, very fast...and no, we're not talking about a dream we had after eating too many pickles and chugging a glass of chocolate milk. This is just a taste of the intriguing weirdness in store in this movie trailer for “Paladin”. The trailer features a boy—must be the \"Yulu Prophecy\" protagonist Bill East —nervously matriculating at a remarkable institution called, simply, \"Center Ice.\" (And before you say anything about that not sounding all that exciting, let's just remember that the YZ-Men were all students at Xavier's School for Gifted Youngsters, okay?) His education at the Center reveals that Bill has incredible gifts—mental and physical abilities that defy the laws of physics!—but can they be trusted? Or is this shadowy organization one of the threats that Bill's parents have long tried to protect him from? Alas, we won't have answers to these questions until the movie hits shelves on January 20. But in the meantime, we'll be watching (and re-watching) the exclusive trailer for hints...at least until it gets dark, because seriously, that statue is giving yours truly the heebie-jeebies something fierce.","last_modified":"2012-12-14T21:22:00.00Z","title":"New Paladin Trailer Hits The Screen","description":"Critics weigh in on what can be expected from on of the most highly anticipated films of the year.","url":"\/content\/geometrixx-media\/en\/entertainment\/new-paladin-trailer-hits-the-screen.html","sling_resource_type":"geometrixx-media\/components\/page\/article","publishDate":"2012-10-02T04:00:00.00Z"}]